[
    {
        "id": "2025_dna_structure_function",
        "title": "Inside the Double Helix: DNA Structure and Function",
        "author": "Matthew Chang",
        "date": "May 28th, 2025",
        "date_raw": "2025-05-28",
        "excerpt": "Explore how the structure of DNA enables it to carry and transmit life's instructions with remarkable stability and precision.",
        "url": "/article.html?id=2025_dna_structure_function",
        "category": "Genes and Genomes",
        "tags": ["Genes and Genomes", "Topic Summary", "AP Biology"],
        "content": "<p>Abstract: DNA is the molecule that carries the instructions for life, guiding how organisms grow, function, and reproduce. This article explores the structure of DNA—from its nucleotide building blocks to its iconic double helix shape—and explains how that structure allows DNA to store, copy, and transmit genetic information with remarkable precision. Key features like base pairing, strand directionality, and chromatin packaging are examined to show how DNA's design supports its essential role in heredity and gene regulation. By understanding how DNA is built, we begin to uncover how it drives everything from cell division to the traits we inherit.</p><p>DNA, or deoxyribonucleic acid, is the blueprint of life. Found in nearly every cell, it holds the instructions for how living things grow, develop, and function. But what makes DNA so powerful isn't just what it's made of—it's how it's put together. Its structure is the key to its ability to store, copy, and pass on genetic information.</p><p>At the most basic level, DNA is made of building blocks called nucleotides. Each nucleotide has three parts: a phosphate group, a sugar called deoxyribose, and one of four nitrogenous bases—adenine (A), thymine (T), cytosine (C), or guanine (G). These nucleotides link together like beads on a string, forming long chains. The phosphate and sugar form the backbone of the DNA strand, while the bases stick out like rungs of a ladder, waiting to pair up.</p><p>What's special about these bases is how they pair: A always pairs with T, and C always pairs with G. These pairs form because of specific hydrogen bonds and the shapes of the molecules. This predictable matching means that if you know the sequence of one strand, you automatically know the other. It's this feature that allows DNA to be copied so precisely during cell division.</p><p>These two strands twist around each other to form the famous double helix. The shape isn't just for looks—it helps stabilize the molecule. The bases stack neatly on top of each other, and the twisting protects the genetic code tucked inside. One full turn of the helix includes about 10.5 base pairs and measures about 3.4 nanometers in length. The diameter stays constant at about 2 nanometers because a large base (a purine) always pairs with a smaller one (a pyrimidine).</p><p>This elegant structure isn't just for stability—it's what makes DNA such a powerful storage system for genetic information. The ability of each base to pair with only one specific partner allows cells to copy DNA with remarkable accuracy, which is essential every time a cell divides. When it's time to make new DNA, the strands simply unzip, and each serves as a template to build its complement. Because of its structure, DNA can be easily read, copied, and even repaired—making it the perfect molecule for life's instructions.</p><p>Another important feature of DNA is its direction. Each strand has a “start” and an “end,” referred to as the 5' and 3' ends, based on the carbon positions in the sugar. In a double helix, the two strands run in opposite directions—this is called antiparallel orientation. This directionality matters because enzymes like DNA polymerase, which help copy DNA, can only work in one direction. Without this organization, DNA replication wouldn't work.</p><p>The structure of DNA isn't just about copying information—it also controls how accessible that information is. Along the helix are grooves, called major and minor grooves, where proteins bind to specific sequences to help turn genes on or off. But to function properly, DNA's double helix must also be efficiently packaged within the tiny space of a cell nucleus.</p><p>This is where chromatin comes in. DNA wraps around proteins called histones to form nucleosomes, like thread wound around spools. These structures fold into higher levels of organization, allowing the long DNA molecule to stay compact yet accessible. This packaging still preserves the integrity of the double helix while helping control which parts of the genome can be used at any given time. The twisting shape of the helix itself also plays a protective role—shielding the bases on the inside, reducing damage, and helping stabilize the molecule over time.</p><p>Because DNA can be copied so precisely and protected so effectively, it allows genetic information to be passed down from cell to cell—and from generation to generation. Its structure makes it not only a molecular storage device, but the very foundation of heredity and life itself.</p>"
      }, 
      {
        "id": "2025_cell_organization",
        "title": "Cell Organization",
        "author": "Matthew Chang",
        "date": "May 31st, 2025",
        "date_raw": "2025-05-31",
        "excerpt": "description later",
        "url": "/article.html?id=2025_cell_organization",
        "category": "Cells and Development",
        "tags": ["Cells and Development", "Topic Summary", "AP Biology"],
        "content": "blah blah blah"
      }    
  ]
  